Tekla.Structures.Catalogs.CatalogHandler.GetSteelFinishItems
Returns the collection of all steel finish items.
Returns: The collection of all steel finish items.

Tekla.Structures.Catalogs.CatalogHandler.ImportShapeItemsFromGeometryFiles(System.String)
Imports shape geometry items from geometry files in specified folder.
Import supports following file formats: ".skp", ".dxf", ".dwg", ".step", ".iges", ".stp", ".igs", ".ifc", ".dgn", ".trb"
File name is used as shape name.
Import throws exception if model is not open.
Import overrides the existing shape items in the catalog without any warnings.
using System;
using Tekla.Structures.Catalogs;
public class Example
{
public void Example1()
{
if (new CatalogHandler().ImportShapeItemsFromGeometryFiles(System.IO.Path.GetTempPath()))
Console.WriteLine("Shape geometries imported successfully to model.");
}
}
path: The path to be used for import.
Returns: true if successful.

Tekla.Structures.Catalogs.CatalogHandler.ExportProfileItems(System.Collections.Generic.IList{System.String},System.String,System.String)
Exports the profile items in the profile database to given path and file name.
Currently library profiles, sketch profiles and clb profiles are supported.
Library profiles are exported to *.lis format.
Sketch profiles are exported to *.uel format.
Clb profiles are exported to *.clb format.
If profiles are not available, export fails.
If path is empty, export fails.
If file name is empty, export fails.
using System;
using Tekla.Structures.Catalogs;
public class Example
{
public void Example1()
{
var profiles = new[] { "HEA100", "HEB100", "HEAA300" };
if (new CatalogHandler().ExportProfileItems(profiles, System.IO.Path.GetTempPath(), "I Profiles"))
{
Console.WriteLine("Profiles exported successfully");
}
}
}
Returns: True on success.